# --------------------------------------------------
# Programm by Yoatn
#
# Start date   19.12.2017   23:00
# End date     20.12.2017   00:30
#  
# Description:
#Напишите программу, которая принимает на вход матрицу, выполняет её транспонирование и выводит результат.
#
# Формат ввода:
# В первой строке указываются два целых числа nn и mm, количество строк и столбцов, соответственно.
# Далее следуют nn строк, содержащих по mm целых чисел, разделённых пробелом.
#
# Формат вывода:
# Программа должна вывести mm строк содержимого транспонированной матрицы. Элементы матрицы стоит разделять пробелом.
#
# Sample Input 1:
# 2 3
# 1 2 3
# 4 5 6
# Sample Output 1:
# 1 4
# 2 5
# 3 6
# Sample Input 2:
# 2 2
# 1 2
# 3 4
# Sample Output 2:
# 1 3
# 2 4
# --------------------------------------------------
#
lines, row = map(int, input().split())
LineIn = [input().split() for _ in range(lines)]

for j in range(row):
    print(' '.join([LineIn[i][j] for i in range(lines)]))

# [print(*[LineIn[i][j] for i in range(lines)]) for j in range(row)]


'''
1 2 3 [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
4 5 6
7 8 9
'''
'''
1 4 7 [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
2 5 8
3 6 9
'''

'''
1 2 3 [[1, 2, 3], [4, 5, 6]]
4 5 6
'''
'''
1 4 [[1, 4], [2, 5], [3, 6]]
2 5
3 6
'''